In [2]:
import pandas as pd
import mysql.connector
from mysql.connector import Error

In [9]:
excel_file = r'C:\Users\Hp\Python\DataAnalysisIntern\Data Analysis\DA  Restaurant orders\menu_items.csv'
df = pd.read_csv(excel_file)

In [27]:
try:
    connection = mysql.connector.connect(
        host='localhost',
        database='mysqlinternship',
        user='root',
        password=''
    )
    print("Connected Successfully")
except Error as e:
    print("Error while connecting to MySQL", e)

Connected Successfully

In [ ]:
cursor = connection.cursor()
for index, row in df.iterrows():
    sql = "INSERT INTO Menu_Details (MenuItem, MenuName, MenuCatagory, MenuPrice) VALUES (%s, %s, %s, %s)"
    values = (row['menu_item_id'], row['item_name'], row['category'], row['price'])
    cursor.execute(sql, values)
connection.commit()

In [24]:
excel_file = r'C:\Users\Hp\Python\DataAnalysisIntern\Data Analysis\DA  Restaurant orders\order_details.csv'
do = pd.read_csv(excel_file)
do.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12234 entries, 0 to 12233
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_id         12234 non-null  int64
 1   order_detail_id  12234 non-null  int64
 2   order_date       12234 non-null  object
 3   order_time       12234 non-null  object
 4   item_id          12097 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 478.0+ KB

In [19]:
# order_details 
#     OrderId INT,
#     OrderDate DATE,
#     OrderTime TIME,
#     ItemId INT
cursor = connection.cursor()
for index, row in df.iterrows():
    sql = "INSERT INTO order_details (OrderId, order_detail_id, OrderDate, OrderTime, ItemId) VALUES (%s, %s, %s, %s,%s)"
    values = (row['order_id'],row['order_detail_id'], row['order_id'], row['order_date'], row['order_time'])
    cursor.execute(sql, values)
connection.commit()

In [29]:
do

       order_id  order_detail_id order_date   order_time  item_id
0             1                1   1/1/2023  11:38:36 AM    109.0
1             2                2   1/1/2023  11:57:40 AM    108.0
2             3                2   1/1/2023  11:57:40 AM    124.0
3             4                2   1/1/2023  11:57:40 AM    117.0
4             5                2   1/1/2023  11:57:40 AM    129.0
...         ...              ...        ...          ...      ...
12229     12230             5369  3/31/2023  10:05:04 PM    109.0
12230     12231             5369  3/31/2023  10:05:04 PM    129.0
12231     12232             5369  3/31/2023  10:05:04 PM    120.0
12232     12233             5369  3/31/2023  10:05:04 PM    122.0
12233     12234             5370  3/31/2023  10:15:48 PM    122.0

[12234 rows x 5 columns]

In [30]:
if connection.is_connected():
    cursor.close()
    connection.close()
    print("MySQL connection is closed")

MySQL connection is closed